app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('prueba3', 'ASD', 'aasdqwe', '123123@ASD.CP221', '$2y$10$GNsmFOnih/5qW3Tox8Vaaei3X2t0g7hkqr4Ds22HClaoLBuljYuwq')
---
public function formValidation(){

    $input = $this->validate([
        'nombre' => 'required|min_length[3]|max_length[25]',
        'apellido' => 'required|min_length[3]|max_length[25]',
        'usuario' => 'required|min_length[3]|max_length[25]',
        'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
        'pass' => 'required|min_length[3]|max_length[10]',
    ],

);
$formModel = new usuario_model();
if (!$input) {
    $data['titulo'] = 'Registro';
    echo view('front/head_view', $data);
    echo view('front/navbar_view');
    echo view('back/usuario/register', ['validation' => $this->validator]);
    echo view('front/footer_view');
} else {
    $formModel->save([
        'nombre' => $this->request->getVar('nombre'),
        'apellido' => $this->request->getVar('apellido'),
        'usuario' => $this->request->getVar('usuario'),
        'email' => $this->request->getVar('email'),
        'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
    ]);